Revit 2027 API
TableSectionData.SetCellCombinedParameters(Int32, Int32, IList<TableCellCombinedParameterData>) Method
 Allows the caller to set combined parameter for a specified cell
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCellCombinedParameters(
	int nRow,
	int nCol,
	IList<TableCellCombinedParameterData> paramData
)
Public Sub SetCellCombinedParameters (
	nRow As Integer,
	nCol As Integer,
	paramData As IList(Of TableCellCombinedParameterData)
)
public:
void SetCellCombinedParameters(
	int nRow,
	int nCol,
	IList<TableCellCombinedParameterData^>^ paramData
)
member SetCellCombinedParameters :
        nRow : int *
        nCol : int *
        paramData : IList<TableCellCombinedParameterData> -> unit
Parameters
nRow Int32
nCol Int32
paramData IList<TableCellCombinedParameterData>
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableSectionData Class
SetCellCombinedParameters Overload
Autodesk.Revit.DB Namespace